{
  "pageTitle": "MinChieh Ku Resume",
  "header": {
    "name": "MinChieh Ku",
    "taglines": [
      "Software Engineer & Cloud Engineer"
    ],
    "contacts": {
      "github": "https://github.com/minchiehku",
      "email": "kujoe111@gmail.com",
      "location": "New Taipei City"
    }
  },
  "intro": {
    "image": "assets/images/resume-profile.PNG?v=2",
    "heading": "About Me",
    "paragraphs": [
      "Master's degree in Information Management from NTPU with hands-on experience in Java, Python, and GenAI. At Far EasTone, utilized AI tools to develop an automated auditing scoring system (RAG) and automated monitoring mechanisms. Applying 4 years of sales experience to better understand user requirements and assist in delivering technical solutions. Holds AWS/Azure certifications and a TOEIC score of 950."
    ]
  },
  "education": [
    {
      "title": "National Taipei University．Master's Degree",
      "meta": "2022/09 - 2024/08",
      "content": "Graduate Institute of Information Management"
    },
    {
      "title": "Ming Chuan University．Bachelor's Degree",
      "meta": "2012/09 - 2016/06",
      "content": "Department of Product Design"
    }
  ],
  "papers": [
    {
      "title": "Research on Scheduling and Allocation for Unmanned Taxi Dispatch Services.",
      "bullets": [
        "Through <strong>designing a ride-matching algorithm in a Java-based simulation environment</strong>, a ride-matching system for unmanned taxis was developed.",
        "Using <strong>object-oriented design</strong>, each role is abstracted as an independent object, calculating the next event's occurrence time and storing it in an <strong>ArrayList</strong> as an event queue.",
        "The algorithm focuses on the <strong>matching problem of multiple customers and multiple vehicles</strong>, with each vehicle being paired with only one customer.",
        "The algorithm considers the <strong>customers' tolerable waiting times</strong> and different vehicle dispatch methods, reducing the overall average waiting time and the worst-case waiting time."
      ]
    }
  ],
  "projects": [
    {
      "title": "My Personal Website",
      "bullets": [
        "List previous <strong>educational background</strong>, <strong>work experience</strong>, <strong>projects</strong>, <strong>certifications</strong>, <strong>skills</strong>, familiar <strong>frontend</strong>, <strong>backend</strong>, and <strong>database technologies</strong>, and <strong>language abilities</strong>.",
        "This website was developed using <strong>Docker technology</strong> and deployed on <strong>AWS</strong>. It runs containers on <strong>EC2</strong> using <strong>Docker Compose</strong>. The frontend and backend are built with <strong>HTML</strong>, <strong>CSS</strong>, <strong>JavaScript</strong>, <strong>Java</strong>, and <strong>Spring Boot</strong>, with <strong>MySQL</strong> as the database.",
        "The <strong>GitHub Page frontend design</strong> is the same as that of the <strong>personal-website project</strong> and is hosted using <strong>GitHub's free static domain service</strong>."
      ],
      "link": "https://minchiehku.github.io/"
    },
    {
      "title": "Cat Breed Detect",
      "bullets": [
        "<strong>catbreeddetect.com</strong> is a <strong>web-based application</strong> designed to <strong>predict the breed of a cat</strong> from an <strong>uploaded image</strong>, utilizing a <strong>trained deep learning model</strong> for <strong>accurate classification</strong>.",
        "The model is developed using the <strong>Cat Breeds Dataset from Kaggle</strong> and is capable of classifying cat images into <strong>67 distinct breeds</strong>.",
        "The application is <strong>containerized using Docker and Docker Compose</strong> and deployed on <strong>AWS ECS (Fargate)</strong>."
      ]
    },
    {
      "title": "TrainGymPT",
      "bullets": [
        "<strong>TrainGymPT</strong> is a <strong>conversational AI fitness assistant application</strong> that provides <strong>exercise recommendations</strong> based on user queries.",
        "This app combines <strong>NLP models</strong> for <strong>intent classification</strong> and <strong>dialogue generation</strong>.",
        "Frontend: <strong>HTML</strong>, <strong>CSS</strong>, <strong>JavaScript</strong>; Backend: <strong>Python</strong>, <strong>Flask</strong>."
      ]
    }
  ],
  "work": [
    {
      "title": "Far EasTone Telecommunications Co., Ltd (FET) Software Engineer",
      "meta": "Jan 2025 — Jul 2025",
      "bullets": [
        "<strong>AI Automated Auditing & Scoring System (GenAI/RAG)</strong>: Developed a RAG Pipeline using LangChain to integrate Llama models and Databricks for multimodal (PDF/Word) data analysis. Implemented retrieval via FAISS to automate scoring processes and improve efficiency.",
        "<strong>Cross-Database ETL Migration (Legacy Migration)</strong>: Developed data synchronization programs using Java (Native JDBC) to migrate data from Oracle to MS SQL. Implemented Transaction Rollback mechanisms to ensure data consistency within intranet environments.",
        "<strong>Web Chatbot E2E Automated Testing</strong>: Built testing scripts using Python and Playwright combined with EasyOCR for CAPTCHA recognition. Integrated scripts with Azure DevOps CI/CD for automated updates to improve test coverage.",
        "<strong>Databricks Job Monitoring API</strong>: Developed a Serverless monitoring intermediary API using TypeScript on Azure Functions to enable job tracking. Utilized TypeORM for the data layer and managed JSON data storage for downstream automated processing.",
        "<strong>Internal System Maintenance</strong>: Maintained reporting systems. Troubleshot file paths and SQL synchronization issues, identifying and resolving configuration problems related to report access."
      ]
    },

        {
      "title": "Dewtek Co., Ltd. Sales",
      "meta": "May 2017 — Aug 2021",
      "bullets": [
        "Assisted in preparing documents for sales, such as equipment specification sheets, operation manuals, equipment selection guides, site planning documents, benefit calculation reports, and quotations.",
        "Supported equipment design tasks, responsible for designing nameplates, brand logo stickers, and operation labels.",
        "Participated in product design, including new shapes, functional concept designs, and equipment site planning designs.",
        "Collaborated with sales during client visits to conduct site surveys, measure equipment installation areas, and plan water, electricity, and gas connections and pathways, while documenting all details meticulously.",
        "Successfully secured over 10 equipment sales contracts and contributed to 20% of the company's sales target in the final six months."
      ]
    }
  ],
  "certifications": [
    { "title": "TOEIC Listening and Reading: 950", "meta": "Exp. Date 2027.10.26" },
    { "title": "TOEIC Speaking and Writing: 150/170", "meta": "Exp. Date 2028.01.11" },
    { "title": "AWS Certified Machine Learning - Specialty", "meta": "Exp. Date 2027.02.21" },
    { "title": "AWS Certified Solutions Architect - Associate", "meta": "Exp. Date 2026.05.26" },
    { "title": "AWS Certified Cloud Practitioner", "meta": "Exp. Date 2026.01.17" },
    { "title": "Microsoft Certified: Azure AI Fundamentals", "meta": "2024.04.08 ~" }
  ],
  "skills": {
    "technical": ["Java", "Python", "TypeScript", "HTML/CSS/JavaScript","SQL", "MySQL", "MS SQL", "Spring Boot", "Flask", "Docker", "Git", "AWS", "Azure", "Databricks", "LangChain", "RAG", "Playwright"],
    "design": ["Adobe AI/PS", "Rhinos"]
  },
  "footer": "Copyright © Min-Chieh Ku",
  "contacts": {
    "github": "https://github.com/minchiehku",
    "email": "kujoe111@gmail.com",
    "location": "New Taipei City"
  }
}
